Documents/НанесениеКодовМаркировкиСУЗИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>НанесениеКодовМаркировкиСУЗИСМПТК</Name>
			<Comment>Отчет об использовании кодов маркировки</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OrderID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиОтчетовСУЗИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовСУЗИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНанесениеКодовМаркировкиСУЗИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИспользованияСУЗИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроизводственнойСерии</Name>
					<Comment>seriesNumber</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроизводственнойЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураИСМПТК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатурыИСМПТК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Comment>Код товара в ИС МПТ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодИдентификации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыОбработкиОтчетовСУЗИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиОтчетовСУЗИСМПТК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
					<Comment>PENDING</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправке</Name>
					<Comment>READY_TO_SEND</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
					<Comment>REJECTED</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>SENT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НанесениеКодовМаркировкиСУЗИСМПТК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Удаляет использованные коды маркировки из пула в случаях:
//   * Все коды маркировки по основанию распечатаны, основание полностью оформлено (по основанию)
//   * Основание не указано или архивировано, коды маркировки распечатаны (по использованным кодам).
//
Процедура ПолучитьИнформациюПоСтатусамНанесения() Экспорт
	
	НастройкаОбменаСУЗ = ИнтерфейсИСМПТК.НастройкиОбменаСУЗ();
	
	Если НастройкаОбменаСУЗ = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Для организации ""%1"" не определена настройка взаимодействия с СУЗ'");
		ТекстСообщения = ИнтеграцияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения);
		
		ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстСообщения,  "Ошибка регламентного задания обновление статусов документов СУЗ");
		
	Иначе
		
		Если ТипЗнч(НастройкаОбменаСУЗ) = Тип("Массив") Тогда
			Для Каждого Настройка Из НастройкаОбменаСУЗ Цикл
				ПолучитьИнформациюПоСтатусамНанесенияПродолжить(Настройка);
			КонецЦикла;
		Иначе
			ПолучитьИнформациюПоСтатусамНанесенияПродолжить(НастройкаОбменаСУЗ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьИнформациюПоСтатусамНанесенияПродолжить(НастройкаОбменаСУЗ)
	
	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НанесениеКодовМаркировкиСУЗИСМПТК.OrderID КАК OrderID,
		|	НанесениеКодовМаркировкиСУЗИСМПТК.Статус КАК Статус,
		|	НанесениеКодовМаркировкиСУЗИСМПТК.Ссылка КАК Ссылка,
		|	НанесениеКодовМаркировкиСУЗИСМПТК.ВидПродукции КАК ВидПродукции
		|ИЗ
		|	Документ.НанесениеКодовМаркировкиСУЗИСМПТК КАК НанесениеКодовМаркировкиСУЗИСМПТК
		|ГДЕ
		|	НЕ НанесениеКодовМаркировкиСУЗИСМПТК.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиОтчетовСУЗИСМПТК.Отклонен)
		|	И НЕ НанесениеКодовМаркировкиСУЗИСМПТК.OrderID = &ПустаяСтрока";
		
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		
		Результат = Запрос.Выполнить();
		
		ОтветСервера = Неопределено;
		
		Если Не Результат.Пустой() Тогда 
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл 
				
				ОтветСервера = ИнтерфейсИСМПТК.ПолучитьСтатусНанесенияКМ(НастройкаОбменаСУЗ, Выборка.ВидПродукции, Выборка.OrderID);
				
				Если Не ЗначениеЗаполнено(ОтветСервера.ТекстОшибки) Тогда
					
					СтатусОтчета = ИнтерфейсИСМПТК.СтатусОбработкиОтчета(ОтветСервера.ДанныеОСтатусах["reportStatus"]);
					Если Не Выборка.Статус = СтатусОтчета Тогда 
						ДокументОбъект 		  = Выборка.Ссылка.ПолучитьОбъект();
						ДокументОбъект.Статус = СтатусОтчета;
						
						Попытка
							ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
						Исключение
							ТекстСообщения = НСтр("ru = 'При записи документа ""%1"" произошла ошибка и документу не был присвоен изменённый статус ""%2""'");
							ТекстСообщения = ИнтеграцияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения,
							ДокументОбъект,
							СтатусОтчета);
							
							ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстСообщения, "Ошибка регламентного задания ""Обновление статусов документов СУЗ""");
							
						КонецПопытки;
					КонецЕсли;
					
				Иначе
					
					ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ОтветСервера.ТекстОшибки);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не ОтветСервера = Неопределено Тогда
			Если ЗначениеЗаполнено(ОтветСервера.ТекстОшибки) Тогда
				ИнтеграцияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ОтветСервера.ТекстОшибки,  "Ошибка регламентного задания ""Обновление статусов документов СУЗ""");
			КонецЕсли;
		КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	ИнтеграцияИСМПТКПереопределяемый.ПриЗаполненииОграниченияДоступа(Ограничение, "НанесениеКодовМаркировкиСУЗИСМПТК");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
